DataProcessors/DICOM_ИсследованияМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>DICOM_ИсследованияМД</Name>
			<Comment>Обработка для работы с реализацией функционала DICOM через сторонние PACS-RIS сервера, к примеру dcm4chee</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/DicomWorkLists.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>DicomWorkLists</Name>
			<Comment>Legacy</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AccessionNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Allergies</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BirthDay</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CommentsOnScheduledProcedureStep</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MedicalAlerts</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Modality</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PatientId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PatientName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PreMedication</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RequestedContrastAgent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RequestedProcedureDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RequestedProcedureID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RequestedProcedurePriority</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RequestingPhysician</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledPerformingPhysiciansName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepLocation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepStartDate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepStartTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledStationAETitle</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledStationName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Sex</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StudyInstanceUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduledProcedureStepSequence</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИсследования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИсследованийDICOM</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторУслуги</Name>
					<Comment>Уникальный идентификатор услуги</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСтрокиСоставаУслуги</Name>
					<Comment>Ключ строки состава услуги</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленоИзMPPS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленоПоЗапросу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсследования</Name>
					<Comment>Уникальный идентификатор исследования</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/DICOM_ИсследованияМД/Forms/DCMTK_Основная/Ext/Form/Module.bsl
#Область СтандартныеОбработки

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//  ДокументВладелец обязан быть (на него записываем файлы), иначе мы прерываем открытие
	Если Параметры.Свойство("ДокументВладелец") И ЗначениеЗаполнено(Параметры.ДокументВладелец) Тогда
		ДокументВладелец = Параметры.ДокументВладелец;	
		ДатаДокумента = ?(ЗначениеЗаполнено(ДокументВладелец.Дата),ДокументВладелец.Дата,ТекущаяДата())
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Ошибка получения документа-владельца исследований!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверяем модуль по работе с DCMTK - без него дальнейшая работа бессмысленна
	ИспользоватьDICOM = Метаданные.ОбщиеМодули.Найти("DICOMРаботаСДрайвером") <> Неопределено; 
	
	Если ИспользоватьDICOM Тогда
		ДанныеDICOMЛистов = ОбновитьDICOMЛистыНаСервере(ДокументВладелец);
		ЗаполнитьDICOMЛисты(ДанныеDICOMЛистов, ЭтаФорма);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Отсутствует необходимый функционал в системе'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры
	
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СоздатьWorklist(Команда)
	мУслуги = Новый Массив(); 
	МассивДокументРаботы = ПолучитьТаблицуРабот(ДокументВладелец);	
	
	Для каждого стрТЧ из МассивДокументРаботы Цикл
		Если ЗначениеЗаполнено(стрТЧ.УИД_DICOM) Тогда
			мУслуги.Добавить(Новый Структура("Номенклатура, УникальныйИдентификатор, КлючСтроки", стрТЧ.Номенклатура, стрТЧ.УИД_DICOM, стрТЧ.КлючСтроки));
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='У одной из услуг не заполнен идентификатор для dicom-исследования. Перезапишите документ, чтобы он сгенерировался автоматически и повторите попытку.'"));
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если мУслуги.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='В документе отсутствуют услуги, заполните вкладку ""Состав услуг"" и повторите попытку.'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыИзДокумента(ДокументВладелец);
	ПараметрыФормы = Новый Структура("Услуги, Прием, Пациент, Врач, МедКарта", мУслуги, ДокументВладелец, Клиент, Сотрудник, МедКарта);
	
	ОткрытьФорму("Обработка.DICOM_ИсследованияМД.Форма.DCMTK_WorklistDICOM",ПараметрыФормы,
					ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,
					Новый ОписаниеОповещения("ОбработкаОповещенияDCMTKФормаWL",ЭтаФорма),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлыDICOM(Команда)

	ПериодВыбора = Новый Структура("ДатаНачала, ДатаОкончания",НачалоДня(ДатаДокумента), КонецДня(ДатаДокумента));
	ИдентификаторыИсследований = Новый Массив();
	Для Каждого Лист Из DICOMЛисты Цикл
		ИдентификаторыИсследований.Добавить(Строка(Лист.StudyInstanceUID));	
	КонецЦикла;
	
	ЗаполнитьРеквизитыИзДокумента(ДокументВладелец);
	ПараметрыВыбораБИТ = Новый Структура("МедицинскаяКарта, Период, ИдентификаторыИсследований", МедКарта, ПериодВыбора, ИдентификаторыИсследований);
	
	ОткрытьФорму("Обработка.DCMTKПрикреплениеФайловDICOM.Форма",ПараметрыВыбораБИТ,ЭтаФорма,
					ЭтаФорма.УникальныйИдентификатор,,,
					Новый ОписаниеОповещения("ОбработкаОповещенияВыборDCMTK",ЭтаФорма),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеDICOM(Команда)
	
	НастройкиDICOM = СформироватьСтруктуруНастроекDICOM();
	ТекДанныеDICOM = Элементы.DICOMЛисты.ТекущиеДанные;
	Если ТекДанныеDICOM <>  Неопределено Тогда
		DICOMРаботаСДрайверомКлиентСервер.ПолучитьДанныеИсследования(ТекДанныеDICOM.StudyInstanceUID,
														НастройкиDICOM.Хранилище,НастройкиDICOM.PACS,
														НастройкиDICOM.AETitle, НастройкиDICOM.ДанныеPACS);
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыDICOM(Команда)
	
	ДанныеDICOMЛистов = ОбновитьDICOMЛистыНаСервере(ДокументВладелец);
	ЗаполнитьDICOMЛисты(ДанныеDICOMЛистов, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаDCMTK

&НаКлиенте
Процедура ОбработкаОповещенияDCMTKФормаWL(Результат, ДопПараметры) Экспорт
	
	// Из создать Worklist
	ДанныеDICOMЛистов = ОбновитьDICOMЛистыНаСервере(ДокументВладелец);
	ЗаполнитьDICOMЛисты(ДанныеDICOMЛистов, ЭтаФорма);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияВыборDCMTK(Результат, ДопПараметры) Экспорт
	
	// Из ВыбратьФайлыDICOM
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого Файл Из Результат Цикл
			СсылкаНаФайл = РаботаСФайламиКлиент.ДобавитьНовыйФайл(ДокументВладелец, Файл.ПутьКФайлу);	
			Если Не ЗначениеЗаполнено(СсылкаНаФайл) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прикрепить файл к Приему");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьDICOMЛисты(ДанныеDICOMЛистов, Форма)
	 
	Форма.DICOMЛисты.Очистить();
	Для Каждого Лист Из ДанныеDICOMЛистов Цикл
		Отбор = Новый Структура("УИД_DICOM", Новый УникальныйИдентификатор(Лист.УИД_DICOM));
		
		//УслугиDICOM = Форма.Объект.Работы.НайтиСтроки(Отбор);
		МассивУслугиDICOM = ПолучитьТаблицуРабот(Форма.ДокументВладелец, Отбор);
		
		Для Каждого СтрокаРаботы Из МассивУслугиDICOM Цикл
			ЗаписьЛиста = Форма.DICOMЛисты.Добавить();
			ЗаписьЛиста.Услуга								= СтрокаРаботы.Номенклатура;
			ЗаписьЛиста.Статус								= Лист.СтатусИсследования;
			ЗаписьЛиста.УникальныйИдентификаторИсследования = Лист.УникальныйИдентификаторИсследования;
			ЗаписьЛиста.StudyInstanceUID					= Лист.StudyInstanceUID;
			ЗаписьЛиста.Оборудование						= Лист.Оборудование;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура DICOMЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.DICOMЛисты.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		УИД				= ТД.УникальныйИдентификаторИсследования;
		Прием			= ДокументВладелец;
		Оборудование	= ТД.Оборудование;
		Структура = Новый Структура("Ключ", ПолучитьКлючDICOM(УИД, Прием, Оборудование));
		ОткрытьФорму("РегистрСведений.DicomWorkLists.Форма.УпрФормаЗаписи", Структура);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьКлючDICOM(УИД, Прием, Оборудование)
  Возврат РегистрыСведений.DicomWorkLists.СоздатьКлючЗаписи(Новый Структура("УникальныйИдентификаторИсследования, Прием, Оборудование", УИД, Прием, Оборудование));
КонецФункции

#КонецОбласти

#Область РаботаСДокументВладелец

&НаСервере
Функция ЗаполнитьРеквизитыИзДокумента(СсылкаДокументВладелец)
		
	ОбъектДокументВладелец = СсылкаДокументВладелец.ПолучитьОбъект();		
	
	Сотрудник = ОбъектДокументВладелец.Врач;		
	МедКарта = ОбъектДокументВладелец.МедицинскаяКарта;		
	Клиент = ОбъектДокументВладелец.Клиент;		
	
КонецФункции

// Получение таблицы значений документа-владельца 
//
// Параметры:
//  СсылкаДокументВладелец	 - ДокументСсылка	- Ссылка на документ, откуда необходимо получить таблицу работ 
//  Отбор					 - Структура	 - структура параметров отбора, по которой необходимо получить массив строк таблицы
// 
// Возвращаемое значение:
//   ТаблицаЗначений, Массив строк таблицы - 
//
&НаСервереБезКонтекста
Функция ПолучитьТаблицуРабот(СсылкаДокументВладелец, Отбор = Неопределено)
	
	ОбъектДокументВладелец = СсылкаДокументВладелец.ПолучитьОбъект();		
	ТаблицаРабот = ОбъектДокументВладелец.Работы.Выгрузить();
	
	Если Отбор = Неопределено Тогда	
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРабот);	
	Иначе		
		МассивСтрок = ТаблицаРабот.НайтиСтроки(Отбор);
		МассивСтруктурРаботы = Новый массив;
		Для каждого СтрокаТаблицыРабот Из МассивСтрок Цикл		
			МассивСтруктурРаботы.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРабот));		
		КонецЦикла;
	    Возврат МассивСтруктурРаботы;
	КонецЕсли;	
	                
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьDICOMЛистыНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DicomWorkLists.RequestedProcedureID КАК УИД_DICOM,
		|	DicomWorkLists.СтатусИсследования,
		|	DicomWorkLists.УникальныйИдентификаторИсследования,
		|	DicomWorkLists.StudyInstanceUID,
		|	DicomWorkLists.Оборудование
		|ИЗ
		|	РегистрСведений.DicomWorkLists КАК DicomWorkLists
		|ГДЕ
		|	DicomWorkLists.Прием = &Прием";
	
	Запрос.УстановитьПараметр("Прием", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеDICOM = РезультатЗапроса.Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеDICOM);

КонецФункции

#КонецОбласти  

#Область ПрочиеФункцииИПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтруктуруНастроекDICOM()
	
	Результат = Новый Структура("Хранилище, PACS, AETitle, ДанныеPACS");
	Результат.Хранилище = DICOMРаботаСДрайвером.ПолучитьХранилищеDICOM();
	Результат.AETitle = DICOMРаботаСДрайвером.ПолучитьAETitleДляЗапросовDICOM();
	Результат.PACS = DICOMРаботаСДрайвером.ПолучитьPACS();
	Результат.ДанныеPACS = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Результат.PACS, "Host, Port");
	
	Возврат Результат;
КонецФункции
	
#КонецОбласти
